import Header from '../../components/Header/Header.jsx';
import Footer from '../../components/Footer/Footer.jsx';
import Page_menu from "../../components/Page_menu/Page_menu.jsx";
import Card from "./Cards.jsx";

import './Home.css'
import {Link} from "react-router-dom";

function HomePage() {
    return (
        <div style={{display: 'flex', flexDirection: 'column', minHeight: '100vh'}}>
            <Header />

            <main className="home-page-main">

                <div className="adds-placeholder" aria-hidden="true">
                    <p>*РЕКЛАМНИЙ БАНЕР*--------- Продам гараж ---------*РЕКЛАМНИЙ БАНЕР*</p>
                </div>

                <Page_menu />

                <section className="home-welcome">
                    <div className="home-welcome-left">
                        <h1>Ласкаво просимо до WikiTravel</h1>
                        <p>вільної енциклопедії, яку може редагувати кожен. Українська WikiTravel заснована 30 січня 2004 року.</p>
                    </div>

                    <div className="home-welcome-right">
                        <p>понеділок, 14 липня 2025 року</p>
                        <p>1 383 199 статей українською</p>
                        <p>190 556 зареєстрованих дописувачів</p>
                        <p>3762 з них активні останнього місяця</p>
                    </div>

                    <nav className="home-welcome-tabs">
                        <Link to="/about">Про нас</Link>
                        <Link to="/navigation">Навігація</Link>
                        <Link to="/content">Зміст</Link>
                        <Link to="/create-article">Створити статтю</Link>
                        <Link to="/register">Реєстрація</Link>
                        <Link to="/banana">Довідка</Link>              {/* banane це затичка щоб швидко знайти де не прокинуті вірні роути*/}
                        <Link to="/banana">Проєкти</Link>
                    </nav>
                </section>

                <section className="home-cards">
                    <Card
                        title="Вибрана стаття"
                        text={
                            "Греція вважається колискою західної цивілізації. Близько 3 тисяч років до \n" +
                            "н. е. на острові Крит виникла високорозвинена мінойська цивілізація, \n" +
                            "культура якої згодом поширилась і на материк. За нею наступила \n" +
                            "крито-мікенська, або егейська культура. Пізніше виникали власне грецькі \n" +
                            "поліси, а також античні міста Північного Причорномор'я, Великої Греції, \n" +
                            "Малої Азії. Культура надзвичайного рівня розвитку ширилась усім середземноморським регіоном, що відбилось в архітектурі, театрі, науці та філософії..."
                        }
                        imageUrl={`https://picsum.photos/seed/0875434/400/500`}
                        imageSize="sm"
                        ctaText="Читати далі"
                        ctaHref="/article/greek"
                        linkText="Усі вибрані статті (241)"
                        linkHref="/featured"
                    />

                    <Card
                        title="Поточні події"
                        text={
                            "Фінал Клубного чемпіонату світу з футболу 2025 — фінальний матч клубного чемпіонату світу 2025 року, який організовано ФІФА. Матч відбувся 13 липня 2025 року на Мет-Лайф Стедіум у місті Іст-Резерфорд між «Челсі» та «Парі Сен-Жермен». Це перший фінал з двома європейськими командами. «Челсі» переміг 3–0 та вдруге виграв турнір..."
                        }
                        imageUrl={`https://picsum.photos/seed/21311/400/300`}
                        imageSize="sm"
                        ctaText="Інші новини"
                        ctaHref="/article/greek"
                        linkText="Новини"
                        linkHref="/featured"
                    />

                    <Card
                        title="Добра стаття"
                        text={
                            "Зоопарк Чанг-ша — зоопарк в місті Чанша, адміністративному центрі провінції Хунань. Користуючись популярністю серед  місцевого населення, заклад перетворився на серйозний  науково-дослідницький центр, у зв'язку з чим було запропоновано його розширення, оновлення та перетворення  на статус Екологічного. 11 грудня 2008 з цього зоопарку до Сучжоу була відправлена 80-річна м'якопанцирна черепаха. Там її очікував 120-річний «наречений». Ці дві особини є єдиними відомими представниками гігантських черепах у Китаї. 29 квітня 2008 шість антарктичних пінгвінів було надіслано у цей зоопарк із зоопарку Даляня. 20 червня 2008 у зоопарку з'явилася молода самиця південно-китайського тигра. Очікується, що партнера для неї незабаром надасть Зоопарк Фучжоу."
                        }
                        imageUrl={`https://picsum.photos/seed/42531/400/300`}
                        imageSize="sm"
                        ctaText="Читати далі"
                        ctaHref="/article/greek"
                        linkText="Усі добрі статті (1051)"
                        linkHref="/featured"
                    />

                    <Card
                        title="Цікавинки"
                        text={
                            "Національний парк Катінбау або Серра-ду-Катінбау (Parque Nacional da Serra do Catimbau), інколи пишеться Катімбау — національний парк в бразильському штаті Пернамбуку. Парк має виключну важливість з двох причин. По-перше, тут розташована одна з найважливіших археологічних ділянок у країні, що містить 28 печер із доісторичними наскельними малюнками та знаряддям віком близько 6 тис. років. По-друге, у парку зберігається одна з найбільших недоторканих ділянок каатинги, унікального для Бразилії біому."
                        }
                        imageUrl={`https://picsum.photos/seed/424/400/300`}
                        imageSize="sm"
                        ctaText="Запропонувати"
                        ctaHref="/article/greek"
                        linkText="Архів"
                        linkHref="/featured"
                    />

                    <Card
                        title="Вибране зображення"
                        text={"Some smart stuff"}
                        imageUrl={`https://picsum.photos/seed/08754334/400/500`}
                        variant="imageTop"
                        imageSize="full"
                        hideLink={true}
                        ctaText="Галерея"
                        ctaHref="/article/greek"
                    />

                    <Card
                        title="Поточні та майбутні події"
                        text={
                            "Montreux Jazz Festival Швейцарія, Монтрьо  4–19 липня 2025  Один з найвідоміших джазових фестивалів у світі, який проходить на берегах Женевського озера. Атмосфера — розслаблена, з ароматом вина та гірського повітря. Ідеальне місце, щоб поєднати музику, природу і швейцарський шарм.\n" +
                            "Gent Jazz Festival Бельгія, Гент 4–19 липня 2025 Гент — місто з каналами та середньовічною архітектурою, перетворюється на джазовий центр Європи. Вуличні джеми, майстер-класи, живе спілкування з артистами — це більше, ніж просто концерт.\n" +
                            "Festival International Nuits d’Afrique Канада, Монреаль 8–20 липня 2025 Африканські барабани, реггі та етно-джаз у центрі Канади. Справжній культурний вибух із музикою, танцями, кухнею та майстерками просто неба."
                        }
                        imageUrl="/placeholder.png"
                        variant="list"
                        imageSize="sm"
                        ctaText="Докладніше"
                        ctaHref="/article/greek"
                        linkText="Архів"
                        linkHref="/featured"
                    />

                </section>


            </main>

            <Footer/>
        </div>
    );
}

export default HomePage;
