import PageLayout from '../PageLayout.jsx';
import Toc from '../../components/ToC/ToC.jsx'
import Page_menu from "../../components/Page_menu/Page_menu.jsx";
import {NavigationTextContainer, NavSection} from "../../components/Nav_section/Nav_section.jsx";

import '../shared.css'


export default function Navigation() {
    const tocItems = [
        { id: "Introduction",  label: "Вступ" },
        { id: "Search",    label: "Пошук сторінок" },
        { id: "Links", label: "Корисні посилання" },
        { id: "Sum",  label: "Підсумок" },
    ];
    return (
        <PageLayout>
            <section className={"shared-wrap"}>
                <aside className="shared__left">
                    <Toc items={tocItems}/>
                </aside>
                <main className="shared__content">
                    <h1 className={"shared-title"}>Довідка: Як орієнтуватися у WikiTravel</h1>
                    <Page_menu className="long-line" mainTab="Сторінка проєкту"/>



                    <NavigationTextContainer>
                        <NavSection id="Introduction" title="Вступ">
                            <p>WikiTravel — це справді велике місце!</p>
                            <p>Для початку варто зазначити, що на сьогодні в нашому довіднику зібрано понад 190 сторінок про країни світу, що охоплюють ключові теми: географію, культуру, міста, туристичні об'єкти, економіку, традиції та цікаві факти. Це найбільша україномовна база коротких країнознавчих матеріалів у межах цього проєкту, яка постійно доповнюється й оновлюється.</p>
                            <p>На додачу до цього, є ще понад 3 600 сторінок, створених для підтримки основного контенту — це регіональні довідки, огляди міст, путівники, тематичні добірки та інші допоміжні матеріали (а це у 2,6 раза більше, ніж основних сторінок про країни!).</p>
                            <p>Цей сайт допоможе вам ознайомитися з технічною побудовою довідника, навчить швидко знаходити потрібну інформацію та познайомить із ключовими розділами, які можуть зацікавити як мандрівника, так і дослідника.</p>
                        </NavSection>

                        <NavSection id="Search" title="Пошук сторінок">
                            <p>Поле пошуку розташоване у верхньому лівому куті екрана. Просто клацніть на нього й почніть вводити назву країни, міста або теми, яка вас цікавить — система одразу ж запропонує список відповідних сторінок. Ви можете натиснути на будь-яку з них, щоб миттєво перейти до потрібного матеріалу. Якщо ж ви введете повну назву та натиснете клавішу ↵ Enter, то будете автоматично перенаправлені на відповідну сторінку.</p>
                            <p>Якщо введене вами слово або фраза не відповідає жодній з існуючих сторінок (або вона має іншу назву), то після натискання ↵ Enter ви потрапите на сторінку розширеного пошуку. Там буде представлено перелік усіх сторінок, у яких згадується ваш запит. Цей варіант також з’являється, якщо після введення тексту в пошуковому полі натиснути на опцію «що містять…» у нижній частині списку підказок. Наприклад, це зручно, якщо ви хочете знайти згадки про «національну кухню» не в одній статті, а у всіх матеріалах довідника, де ця тема згадується.</p>
                            <p>Сторінка пошуку дозволяє також знаходити результати за тематичними категоріями. За замовчуванням здійснюється пошук у базових статтях про країни, але ви можете обрати інші варіанти — наприклад, лише по міських довідниках, по розділах з історії або по туристичних путівниках.</p>
                        </NavSection>

                        <NavSection id="Links" title="Корисні посилання">
                            <p>Ваше ім’я користувача веде на Ваш профіль — тут можна вказати, чим Ви цікавитеся, які
                                проєкти з озеленення Вас надихають або над чим працюєте.<br/>
                                Обговорення — Ваша персональна сторінка, де інші користувачі можуть залишити поради,
                                запитання або коментарі щодо Ваших ідей.<br/>
                                Чернетка — особистий простір для зберігання нотаток, розробки планів озеленення або
                                підготовки публікацій до публічного перегляду.</p>
                            <p>Список спостереження дозволяє стежити за оновленнями на сторінках про конкретні сквери,
                                парки, урбаністичні ініціативи або користувачів, які Вас цікавлять.<br/>
                                Внесок — перегляд усіх Ваших публікацій і дописів.<br/>
                                Вийти — вихід із системи.<br/>
                                Довідка — базовий путівник для новачків і тих, хто хоче краще зрозуміти, як працює
                                платформа.<br/>
                                На нашій платформі є ключові сторінки, які допоможуть Вам краще включитися в роботу:
                                Обговорення спільноти — розділ для обговорень, питань або пропозицій.</p>
                        </NavSection>

                        <NavSection id="Sum" title="Підсумок">
                            <p>На сайті існують різні типи сторінок, які згруповані за своїм призначенням у так звані «простори».</p>
                            <p>Більшість сторінок мають також власну сторінку для обговорення — тут можна поставити запитання або залишити коментарі, що стосуються змісту основної сторінки.</p>
                            <p>Щоб знайти потрібну інформацію, скористайтеся полем пошуку у верхньому лівому куті.</p>
                            <p>На сайті є перенаправлення — вони автоматично ведуть Вас з одного запису на інший. Також існують службові скорочення, які допомагають швидше орієнтуватися в матеріалах. Вони працюють як звичайні перенаправлення.</p>
                            <p>Більше інформації:</p>
                            <p>
                                <br/>
                                <a href="/placeholder.png">[Довідка:Сторінки обговорення]</a>
                                <br/>
                                <a href="/placeholder.png">[Довідка:Пошук]</a>
                                <br/>
                                <a href="/placeholder.png">[Довідка:Простір назв]</a>
                            </p>
                        </NavSection>
                    </NavigationTextContainer>

                </main>
            </section>
        </PageLayout>
    );
}
